import i18nEnglish from "./languages/i18n_English"
import i18nTurkish from "./languages/i18n_Turkish"

const TEXT = "text"

const rusTextsOnly = {
  'Получить код доступа': TEXT,
  '* Введите номер телефона': TEXT,
  '⚠️ Обязательное поле': TEXT,
  '⚠️ Введите номер телефона': TEXT,
  'Рынок акций - это игра.': TEXT,
  'Игра на деньги 💵': TEXT,
  'Побеждай!': TEXT,
  'Увеличивай свой капитал': TEXT,
  'вместе с': TEXT,

  '⚠️ Введите последние 4 цифры входящего номера': TEXT,
  '⚠️ Введите верно, последние 4 цифры входящего номера': TEXT,
  'Войти': TEXT,
  'Сейчас поступит звонок, на указанный вами номер телефона': TEXT,
  'Для аутентификации введите последние 4 цифры входящего номера': TEXT,

  'Домой': TEXT,
  'Новости': TEXT,
  'Чат': TEXT,

  'страница ДОМ в процессе разработки': TEXT,
  'страница НОВОСТИ в процессе разработки': TEXT,
  'страница ЧАТ в процессе разработки': TEXT,

  'Донаты': TEXT,
  'Портфель': TEXT,
  'Рекорды': TEXT,
  'Токен': TEXT,

  'шт': TEXT,
  'средняя цена': TEXT,

  'Сейчас здесь пусто!': TEXT,
  'Подключите Тинькофф.Инвестиции': TEXT,
  'Искусственный интеллект': TEXT,
  'составит уникальный анализ': TEXT,
  'вашего портфеля 😎': TEXT,
  'Подключить': TEXT,
  'Тинькофф.Инвестиции': TEXT,

  'Токен позволяет': TEXT,
  'искусственному интеллекту': TEXT,
  'сканировать ваши сделки 💡': TEXT,
  'Безопасно!': TEXT,
  'Есть два вида токена:': TEXT,
  '"для чтения" и "полный доступ"': TEXT,
  'Вам нужен токен:': TEXT,
  'только "для чтения" ✅': TEXT,
  'Получить токен': TEXT,

  '⚠️ Вставьте токен': TEXT,
  'Перейдите в настройки профиля': TEXT,
  'Тинькофф Инвестиции по ссылке:': TEXT,
  'Войдите под вашим аккаунтом': TEXT,
  'на сайте Тинькофф': TEXT,
  'Нажмите "Создать токен"': TEXT,
  'Создайте токен для чтения': TEXT,
  'Скопируйте его': TEXT,
  'Вставьте, скопированный токен': TEXT,
  'Сохранить токен ✅': TEXT,

  'Не удалось вставить': TEXT,
  'этот токен !': TEXT,
  'Создайте токен еще раз': TEXT,
  '👌 Создать токен': TEXT,

  'Токен успешно': TEXT,
  'установлен !': TEXT,
  'Идет анализ вашего портфеля': TEXT,
  'Его результаты будут': TEXT,
  'опубликованы в Профиле 👍': TEXT,
  'Отлично 👍': TEXT,
  'Перейти в Профиль': TEXT,
}

const rusTexts = {  
}

export type I18n = Record<keyof typeof rusTexts | keyof typeof rusTextsOnly, string>

const rus: I18n =
  Object.keys(rusTextsOnly)
    .reduce((acc, key) => ({ ...acc, [key]: key }), rusTexts) as I18n

const getI18n = (lang: 'Rus' | 'Eng' | 'Tur'): I18n => {
  switch (lang) {
    case 'Rus': return rus
    case 'Eng': return i18nEnglish    
    case 'Tur': return i18nTurkish
  }
}

const I18nApp  = {
  getI18n
}

export default I18nApp
