import { I18n } from "../i18n"

const i18nTurkish: I18n = {
  'Получить код доступа': 'Erişim Kodunu Al', 
  '* Введите номер телефона': '* Telefon Numarasını Girin',
  '⚠️ Обязательное поле': '⚠️ Zorunlu Alan',
  '⚠️ Введите номер телефона': 'Telefon Numarasını Girin ⚠️',
  'Рынок акций - это игра.': 'Hisse senedi piyasası bir oyun.',
  'Игра на деньги 💵': 'Para oyunu 💵',
  'Побеждай!': 'Kazan!',
  'Увеличивай свой капитал': 'Sermayeni artır',
  'вместе с': 'ile birlikte',

  '⚠️ Введите последние 4 цифры входящего номера': '⚠️ Gelen numaranın son 4 hanesini girin',
  '⚠️ Введите верно, последние 4 цифры входящего номера': '⚠️ Son 4 hane doğru girildiğinden emin olun',
  'Войти': 'Giriş Yap',
  'Сейчас поступит звонок, на указанный вами номер телефона': 'Şu anda belirttiğiniz telefon numarasına bir arama yapılacak',
  'Для аутентификации введите последние 4 цифры входящего номера': 'Kimlik doğrulama için gelen numaranın son 4 hanesini girin',

  'Домой': 'Ana Sayfa',
  'Новости': 'Haberler',
  'Чат': 'Sohbet',

  'страница ДОМ в процессе разработки': 'Ana Sayfa sayfası geliştirme aşamasında',
  'страница НОВОСТИ в процессе разработки': 'Haberler sayfası geliştirme aşamasında',
  'страница ЧАТ в процессе разработки': 'Sohbet sayfası geliştirme aşamasında',

  'Донаты': 'Bağışlar',
  'Портфель': 'Portföy',
  'Рекорды': 'Rekorlar',
  'Токен': 'Token',

  'шт': 'adet',
  'средняя цена': 'ortalama fiyat',

  'Сейчас здесь пусто!': 'Şu anda burası boş!',
  'Подключите Тинькофф.Инвестиции': "Tinkoff Yatırımları'na bağlan",
  'Искусственный интеллект': 'Yapay Zeka',
  'составит уникальный анализ': 'portföyünüzün benzersiz bir analizini yapacak',
  'вашего портфеля 😎': 'portföyünüzün 😎',
  'Подключить': 'Bağlan',
  'Тинькофф.Инвестиции': 'Tinkoff Yatırımları',

  'Токен позволяет': 'Token,',
  'искусственному интеллекту': 'yapay zeka',
  'сканировать ваши сделки 💡': 'işlemlerinizi tarayabilir 💡',
  'Безопасно!': 'Güvenli!',
  'Есть два вида токена:': 'İki tür token var:',
  '"для чтения" и "полный доступ"': '"Okuma" ve "tam erişim"',
  'Вам нужен токен:': 'Size bir token gerek:',
  'только "для чтения" ✅': 'sadece "okuma" ✅',
  'Получить токен': 'Token Al',

  '⚠️ Вставьте токен': "⚠️ Token'ı yapıştırın",
  'Перейдите в настройки профиля': 'Profil ayarlarına gidin',
  'Тинькофф Инвестиции по ссылке:': 'Tinkoff Yatırımları bağlantısı üzerinden:',
  'Войдите под вашим аккаунтом': 'Hesabınızla giriş yapın',
  'на сайте Тинькофф': 'Tinkoff web sitesinde',
  'Нажмите "Создать токен"': '"Token Oluştur"\'a tıklayın',
  'Создайте токен для чтения': 'Okuma tokenı oluşturun',
  'Скопируйте его': 'Onu kopyala',
  'Вставьте, скопированный токен': 'Yapıştır, kopyalanan token',
  'Сохранить токен ✅': 'Token\'ı kaydet ✅',

  'Не удалось вставить': 'Eklenemedi',
  'этот токен !': 'bu belirteç!',
  'Создайте токен еще раз': 'Belirteci tekrar oluşturun',
  '👌 Создать токен': '👌 Belirteç oluştur',

  'Токен успешно': 'Belirteç başarıyla',
  'установлен !': 'kuruldu!',
  'Идет анализ вашего портфеля': 'Portföyünüzün analizi yapılıyor',
  'Его результаты будут': 'Sonuçları',
  'опубликованы в Профиле 👍': 'Profilde yayınlanacak 👍',
  'Отлично 👍': 'Harika 👍',
  'Перейти в Профиль': 'Profili Görüntüle',
}

export default i18nTurkish
  