import { I18n } from "../i18n"

const i18nEnglish: I18n = {
    'Получить код доступа': 'Get Access Code',
    '* Введите номер телефона': '* Enter Phone Number',
    '⚠️ Обязательное поле': '⚠️ Mandatory Field',
    '⚠️ Введите номер телефона': '⚠️ Enter Phone Number',
    'Рынок акций - это игра.': 'Stock market is a game.',
    'Игра на деньги 💵': 'Money game 💵',
    'Побеждай!': 'Win!',
    'Увеличивай свой капитал': 'Increase your capital',
    'вместе с': 'together with',

    '⚠️ Введите последние 4 цифры входящего номера': '⚠️ Enter the last 4 digits of the incoming number',
    '⚠️ Введите верно, последние 4 цифры входящего номера': '⚠️ Enter the last 4 digits correctly of the incoming number',
    'Войти': 'Log In',
    'Сейчас поступит звонок, на указанный вами номер телефона': 'A call will be received now, to the phone number you provided',
    'Для аутентификации введите последние 4 цифры входящего номера': 'For authentication, enter the last 4 digits of the incoming number',

    'Домой': 'Home',
    'Новости': 'News',
    'Чат': 'Chat',

    'страница ДОМ в процессе разработки': 'Home page under development',
    'страница НОВОСТИ в процессе разработки': 'News page under development',
    'страница ЧАТ в процессе разработки': 'Chat page under development',

    'Донаты': 'Donations',
    'Портфель': 'Portfolio',
    'Рекорды': 'Records',
    'Токен': 'Token',

    'шт': 'pcs',
    'средняя цена': 'average price',

    'Сейчас здесь пусто!': 'It is empty here now!',
    'Подключите Тинькофф.Инвестиции': 'Connect Tinkoff.Investments',
    'Искусственный интеллект': 'Artificial Intelligence',
    'составит уникальный анализ': 'will provide a unique analysis',
    'вашего портфеля 😎': 'of your portfolio 😎',
    'Подключить': 'Connect',
    'Тинькофф.Инвестиции': 'Tinkoff.Investments',

    'Токен позволяет': 'Token allows',
    'искусственному интеллекту': 'to artificial intelligence',
    'сканировать ваши сделки 💡': 'scan your transactions 💡',
    'Безопасно!': 'Safely!',
    'Есть два вида токена:': 'There are two types of tokens:',
    '"для чтения" и "полный доступ"': '"Read" and "full access"',
    'Вам нужен токен:': 'You need a token:',
    'только "для чтения" ✅': 'only "read" ✅',
    'Получить токен': 'Get Token',

    '⚠️ Вставьте токен': '⚠️ Paste the token',
    'Перейдите в настройки профиля': 'Go to profile settings',
    'Тинькофф Инвестиции по ссылке:': 'Tinkoff Investments at the link:',
    'Войдите под вашим аккаунтом': 'Log in under your account',
    'на сайте Тинькофф': 'on the Tinkoff website',
    'Нажмите "Создать токен"': 'Click "Create Token"',
    'Создайте токен для чтения': 'Create a read token',
    'Скопируйте его': 'Copy it',
    'Вставьте, скопированный токен': 'Paste the copied token',
    'Сохранить токен ✅': 'Save the token ✅',

    'Не удалось вставить': 'Failed to insert',
    'этот токен !': 'this token!',
    'Создайте токен еще раз': 'Create the token again',
    '👌 Создать токен': '👌 Create token',

    'Токен успешно': 'Token successfully',
    'установлен !': 'set!',
    'Идет анализ вашего портфеля': 'Analyzing your portfolio',
    'Его результаты будут': 'Its results will be',
    'опубликованы в Профиле 👍': 'published in the Profile 👍',
    'Отлично 👍': 'Excellent 👍',
    'Перейти в Профиль': 'Go to Profile',
  }

  export default i18nEnglish
  